#+TITLE: Vonpupp's Spacemacs configuration (user-config)
#+SETUPFILE:~/org/exobrain/hugo_setup_exobrain.org
#+HUGO_SECTION: exobrain
#+HUGO_CATEGORIES: english configs
#+HUGO_TAGS: emacs
#+STARTUP: overview
#+STARTUP: indent

- confidence :: unfinished
- importance :: 9/10
- nodes :: TBD

*** Org agenda
:PROPERTIES:
:ID:       927806aa-8921-432c-832d-dff6d83563f1
:END:
#+BEGIN_SRC emacs-lisp :tangle ~/.spacemacs.d/config-public/public-config.el
  (setq org-agenda-files (directory-files-recursively my-agenda-directory "\\.org$"))
  ;; Doc: https://stackoverflow.com/a/29905161/1332764
  (setq org-agenda-include-diary t)
  (setq org-agenda-start-on-weekday 7)
  ;; (setq org-agenda-skip-function '(org-agenda-skip-entry-if 'todo '("HABIT" "REPEAT")))
  (setq org-agenda-custom-commands
   (quote (
     ;; gtd base states
     ("d" "TODO state" todo "TODO"
      ((org-agenda-overriding-header "TODO tasks")))
     ("s" "SOMEDAY state" todo "SOMEDAY"
      ((org-agenda-overriding-header "SOMEDAY tasks")))
     ("n" "NEXT state" todo "NEXT"
      ((org-agenda-overriding-header "NEXT tasks")))
     ("w" "WAITING state" todo "WAITING"
      ((org-agenda-overriding-header "WAITING tasks")))
     ("p" "PROJ state" todo "PROJ"
      ((org-agenda-overriding-header "PROJ tasks")))
     ("d" "DONE state" todo "DONE"
      ((org-agenda-overriding-header "DONE tasks")))
     ("c" "CANCELLED state" todo "CANCELLED"
      ((org-agenda-overriding-header "CANCELLED tasks")))
     ("k" "SKIPPED state" todo "SKIPPED"
      ((org-agenda-overriding-header "SKIPPED tasks")))
     ;; other filters
     ("l" "All actionable tasks" todo "TODO|NEXT|WAITING|PROJ"
      ((org-agenda-overriding-header "TODO tasks")))
     ("h" "Habits" tags-todo "+habit"
      ((org-agenda-overriding-header "Habits")))
     ("1" "ME" tags-todo "+ME"
      ((org-agenda-overriding-header "ME tag")))
     ("2" "RELATING" tags-todo "+RELATING"
      ((org-agenda-overriding-header "RELATING tag")))
     ("3" "DOING" tags-todo "+DOING"
      ((org-agenda-overriding-header "DOING tag")))
     ("i" "Important things to do"
      ((tags-todo "ME"
                  ((org-agenda-overriding-header "Me tag")))
       (tags-todo "RELATING"
                  ((org-agenda-overriding-header "Relating tag"))))
      nil nil)
  )))
#+END_SRC

#+RESULTS:
| d | TODO state             | todo                                                                                                                        | TODO      | ((org-agenda-overriding-header TODO tasks))      |         |      |                                             |
| s | SOMEDAY state          | todo                                                                                                                        | SOMEDAY   | ((org-agenda-overriding-header SOMEDAY tasks))   |         |      |                                             |
| n | NEXT state             | todo                                                                                                                        | NEXT      | ((org-agenda-overriding-header NEXT tasks))      |         |      |                                             |
| w | WAITING state          | todo                                                                                                                        | WAITING   | ((org-agenda-overriding-header WAITING tasks))   |         |      |                                             |
| p | PROJ state             | todo                                                                                                                        | PROJ      | ((org-agenda-overriding-header PROJ tasks))      |         |      |                                             |
| d | DONE state             | todo                                                                                                                        | DONE      | ((org-agenda-overriding-header DONE tasks))      |         |      |                                             |
| c | CANCELLED state        | todo                                                                                                                        | CANCELLED | ((org-agenda-overriding-header CANCELLED tasks)) |         |      |                                             |
| k | SKIPPED state          | todo                                                                                                                        | SKIPPED   | ((org-agenda-overriding-header SKIPPED tasks))   |         |      |                                             |
| l | All actionable tasks   | todo                                                                                                                        | TODO      | NEXT                                             | WAITING | PROJ | ((org-agenda-overriding-header TODO tasks)) |
| h | Habits                 | tags-todo                                                                                                                   | +habit    | ((org-agenda-overriding-header Habits))          |         |      |                                             |
| 1 | ME                     | tags-todo                                                                                                                   | +ME       | ((org-agenda-overriding-header ME tag))          |         |      |                                             |
| 2 | RELATING               | tags-todo                                                                                                                   | +RELATING | ((org-agenda-overriding-header RELATING tag))    |         |      |                                             |
| 3 | DOING                  | tags-todo                                                                                                                   | +DOING    | ((org-agenda-overriding-header DOING tag))       |         |      |                                             |
| i | Important things to do | ((tags-todo ME ((org-agenda-overriding-header Me tag))) (tags-todo RELATING ((org-agenda-overriding-header Relating tag)))) | nil       | nil                                              |         |      |                                             |

